<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111-002/H02/V02 (Spring)<br>Introduction to Databases
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 1: SQL Queries
</span>
</center></i>

# Introduction

## Objectives

This section of homework 1 has you practice and build skill with:
- Importing data into a relational database.
- Performing simple SQL queries to analyze the data.


## Setup

- This homework involves querying data in an [SQLite](https://www.sqlite.org/index.html) database that you create.


- You will load CSV files from the [Lahman Baseball Database](http://www.seanlahman.com/). We provided a zip file. The zip file contains:
    - This notebook, which you can use as a template for completing this part of HW 1.
    - A directory ```./Data``` that contains the data you will need.


- The format of the questions is:
    1. A definition of that the query or code snippet should do/produce.
    2. A markdown cell where you enter the query. You run the query to produce the result.
    
    
- There is an example.


- You use iPython-SQL (```%sql, %%sql```) to execute the queries.


- The code cell below initializes the environments, creates a local SQLite database file (if it does not exist) and connects to the file.


- You may need to install the python package ```sqlalchemy```. This can be done by opening terminal and typing "pip install sqlalchemy" https://pypi.org/project/SQLAlchemy/

In [1]:
%load_ext sql
%sql sqlite:///Data/hw1sql.db

'Connected: @Data/hw1sql.db'

In [2]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/zjh/opt/anaconda3/lib/python3.7/site-packages (1.3.9)
Note: you may need to restart the kernel to use updated packages.

# Questions

## Q1

- Loading data from files in various formats into Python data structures and databases for processing and analysis is extremely common.


- Complete the following code fragment. Only one line of code is required here. This fragment should load data from a CSV file into a [Pandas data frame.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)Hint: use the file path 

- Cells after the code fragment contain tests and sample answers that you should reproduce.

<u>Answer</u>

In [3]:
import pandas as pd
import os

def load_csv_to_df(fn):
    
    with open(fn) as data_file:
        print("The full file path is: ", os.path.realpath(data_file.name))

        ###### Your Code Goes Here #####
        df=pd.read_csv(os.path.realpath(data_file.name))
    
        
        
        ##### End Code #####
        
        print("Loaded data frame. ")
        return df

<u>Tests</u>

In [4]:
csv_files = ['People', 'Salaries', 'CollegePlaying', 'Schools', 'Batting', 'HallOfFame']


dfs = {}

for f in csv_files:
    fn = "./Data/" + f + ".csv"
    dfs[f] = load_csv_to_df(fn)
    print("Loaded file " + f)

The full file path is:  /Users/zjh/Desktop/Columbia/term 2/Intro to database/HW1 PartB/hw1_sql/Data/People.csv
Loaded data frame.
Loaded file People
The full file path is:  /Users/zjh/Desktop/Columbia/term 2/Intro to database/HW1 PartB/hw1_sql/Data/Salaries.csv
Loaded data frame.
Loaded file Salaries
The full file path is:  /Users/zjh/Desktop/Columbia/term 2/Intro to database/HW1 PartB/hw1_sql/Data/CollegePlaying.csv
Loaded data frame.
Loaded file CollegePlaying
The full file path is:  /Users/zjh/Desktop/Columbia/term 2/Intro to database/HW1 PartB/hw1_sql/Data/Schools.csv
Loaded data frame.
Loaded file Schools
The full file path is:  /Users/zjh/Desktop/Columbia/term 2/Intro to database/HW1 PartB/hw1_sql/Data/Batting.csv
Loaded data frame.
Loaded file Batting
The full file path is:  /Users/zjh/Desktop/Columbia/term 2/Intro to database/HW1 PartB/hw1_sql/Data/HallOfFame.csv
Loaded data frame.
Loaded file HallOfFame

- The next cells print the first 5 rows in each dataframe to help you confirm that you loaded the data. Your execution should produce the same answer as the cells below. __Remember,__ your execution will overwrite the ones in this notebook. So, you should make a copy of the correct answers for comparison.

In [5]:
for k,v in dfs.items():
    print ("\n\n************* Data for dataframe = ", k, "*************\n")
    print (v.head(5))

************* Data for dataframe =  People *************

    playerID  birthYear  birthMonth  birthDay birthCountry birthState  \
0  aardsda01     1981.0        12.0      27.0          USA         CO
1  aaronha01     1934.0         2.0       5.0          USA         AL
2  aaronto01     1939.0         8.0       5.0          USA         AL
3   aasedo01     1954.0         9.0       8.0          USA         CA
4   abadan01     1972.0         8.0      25.0          USA         FL

    birthCity  deathYear  deathMonth  deathDay  ... nameLast       nameGiven  \
0      Denver        NaN         NaN       NaN  ...  Aardsma     David Allan
1      Mobile        NaN         NaN       NaN  ...    Aaron     Henry Louis
2      Mobile     1984.0         8.0      16.0  ...    Aaron      Tommie Lee
3      Orange        NaN         NaN       NaN  ...     Aase  Donald William
4  Palm Beach        NaN         NaN       NaN  ...     Abad   Fausto Andres

  weight height bats throws       debut   finalGame   retroID    bbrefID
0  215.0   75.0    R      R  2004-04-06  2015-08-23  aardd001  aardsda01
1  180.0   72.0    R      R  1954-04-13  1976-10-03  aaroh101  aaronha01
2  190.0   75.0    R      R  1962-04-10  1971-09-26  aarot101  aaronto01
3  190.0   75.0    R      R  1977-07-26  1990-10-03  aased001   aasedo01
4  184.0   73.0    L      L  2001-09-10  2006-04-13  abada001   abadan01

[5 rows x 24 columns]


************* Data for dataframe =  Salaries *************

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000


************* Data for dataframe =  CollegePlaying *************

    playerID schoolID  yearID
0  aardsda01   pennst    2001
1  aardsda01     rice    2002
2  aardsda01     rice    2003
3   abadan01  gamiddl    1992
4   abadan01  gamiddl    1993


************* Data for dataframe =  Schools *************

     schoolID                     name_full         city state country
0  abilchrist  Abilene Christian University      Abilene    TX     USA
1     adelphi            Adelphi University  Garden City    NY     USA
2    adrianmi                Adrian College       Adrian    MI     USA
3       akron           University of Akron        Akron    OH     USA
4     alabama         University of Alabama   Tuscaloosa    AL     USA


************* Data for dataframe =  Batting *************

    playerID  yearID  stint teamID lgID   G   AB   R   H  2B  ...   RBI   SB  \
0  abercda01    1871      1    TRO  NaN   1    4   0   0   0  ...   0.0  0.0
1   addybo01    1871      1    RC1  NaN  25  118  30  32   6  ...  13.0  8.0
2  allisar01    1871      1    CL1  NaN  29  137  28  40   4  ...  19.0  3.0
3  allisdo01    1871      1    WS3  NaN  27  133  28  44  10  ...  27.0  1.0
4  ansonca01    1871      1    RC1  NaN  25  120  29  39  11  ...  16.0  6.0

    CS  BB   SO  IBB  HBP  SH  SF  GIDP
0  0.0   0  0.0  NaN  NaN NaN NaN   0.0
1  1.0   4  0.0  NaN  NaN NaN NaN   0.0
2  1.0   2  5.0  NaN  NaN NaN NaN   1.0
3  1.0   0  2.0  NaN  NaN NaN NaN   0.0
4  2.0   2  1.0  NaN  NaN NaN NaN   0.0

[5 rows x 22 columns]


************* Data for dataframe =  HallOfFame *************

    playerID  yearID votedBy  ballots  needed  votes inducted category  \
0   cobbty01    1936   BBWAA    226.0   170.0  222.0        Y   Player
1   ruthba01    1936   BBWAA    226.0   170.0  215.0        Y   Player
2  wagneho01    1936   BBWAA    226.0   170.0  215.0        Y   Player
3  mathech01    1936   BBWAA    226.0   170.0  205.0        Y   Player
4  johnswa01    1936   BBWAA    226.0   170.0  189.0        Y   Player

  needed_note
0         NaN
1         NaN
2         NaN
3         NaN
4         NaN


## Q1 $-$ Loading the Data

- There are two parts to this question.

__Part 1__

- Write a set of SQL statements that drop the tables ```People, Salaries, CollegePlaying, Batting, School, HallOfFame``` from your database file. 

- Your statements must not produce any errors or warnings.

- This step is to make sure there are no prexisting tables with the same names in your sqlite database that could throw an error. 

<u>Answer:</u>

In [6]:
%%sql
DROP TABLE IF EXISTS People;
DROP TABLE IF EXISTS Salaries;
DROP TABLE IF EXISTS CollegePlaying;
DROP TABLE IF EXISTS Batting;
DROP TABLE IF EXISTS Schools;
DROP TABLE IF EXISTS HallOfFame

 * sqlite:///Data/hw1sql.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

__Part 2__

- The following cell is an implementation template for a function that will create a table for a data frame and load the data into the table.

<u>Answer</u>

In [7]:
def df_to_sql_table(table_name, df, database_connection, index_label):
    """
    
    :param table_name: The name of the RDB table to create
    :param df: The dataframe holding data to write to the RDB table.
    :param database_connection: An open connection to a database to use for writing the data. We create the connection
        in the next cell. 
    :param index_label: Pandas data frames contain indexes. What is the name of the column in the DB table
        that we should use to store the index information.
    :return: None
    """
    
    ##### Your Code Goes Here #####
    df.to_sql(name=table_name, con=database_connection,index_label=index_label)

    ##### End Your Code #####
    
    print("Created and loaded table = ", table_name)

- You must create a connection.

In [8]:
# You must create an SQLite connection to the DB you created to
# insert the data and create the tables.
import sqlite3

##### Make the connection by completing the statement.
conn = sqlite3.connect('/Users/zjh/Desktop/Columbia/term 2/Intro to database/HW1 PartB/hw1_sql/Data/hw1sql.db')

<u>Tests</u>

In [9]:
for k,v in dfs.items():
    df_to_sql_table(k, v, conn, index_label="id")

Created and loaded table =  People
Created and loaded table =  Salaries
Created and loaded table =  CollegePlaying
Created and loaded table =  Schools
Created and loaded table =  Batting
Created and loaded table =  HallOfFame

- The following cells display the first five rows from each table.

In [10]:
%sql select * from People limit 5;

 * sqlite:///Data/hw1sql.db
Done.

[(0, 'aardsda01', 1981.0, 12.0, 27.0, 'USA', 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', 215.0, 75.0, 'R', 'R', '2004-04-06', '2015-08-23', 'aardd001', 'aardsda01'),
 (1, 'aaronha01', 1934.0, 2.0, 5.0, 'USA', 'AL', 'Mobile', None, None, None, None, None, None, 'Hank', 'Aaron', 'Henry Louis', 180.0, 72.0, 'R', 'R', '1954-04-13', '1976-10-03', 'aaroh101', 'aaronha01'),
 (2, 'aaronto01', 1939.0, 8.0, 5.0, 'USA', 'AL', 'Mobile', 1984.0, 8.0, 16.0, 'USA', 'GA', 'Atlanta', 'Tommie', 'Aaron', 'Tommie Lee', 190.0, 75.0, 'R', 'R', '1962-04-10', '1971-09-26', 'aarot101', 'aaronto01'),
 (3, 'aasedo01', 1954.0, 9.0, 8.0, 'USA', 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', 190.0, 75.0, 'R', 'R', '1977-07-26', '1990-10-03', 'aased001', 'aasedo01'),
 (4, 'abadan01', 1972.0, 8.0, 25.0, 'USA', 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', 184.0, 73.0, 'L', 'L', '2001-09-10', '2006-04-13', 'abada001', 'abadan01')]

In [11]:
%sql select * from Salaries limit 5;

 * sqlite:///Data/hw1sql.db
Done.

[(0, 1985, 'ATL', 'NL', 'barkele01', 870000),
 (1, 1985, 'ATL', 'NL', 'bedrost01', 550000),
 (2, 1985, 'ATL', 'NL', 'benedbr01', 545000),
 (3, 1985, 'ATL', 'NL', 'campri01', 633333),
 (4, 1985, 'ATL', 'NL', 'ceronri01', 625000)]

In [12]:
%sql select * from CollegePlaying limit 5;

 * sqlite:///Data/hw1sql.db
Done.

[(0, 'aardsda01', 'pennst', 2001),
 (1, 'aardsda01', 'rice', 2002),
 (2, 'aardsda01', 'rice', 2003),
 (3, 'abadan01', 'gamiddl', 1992),
 (4, 'abadan01', 'gamiddl', 1993)]

In [13]:
%sql select * from Schools limit 5;

 * sqlite:///Data/hw1sql.db
Done.

[(0, 'abilchrist', 'Abilene Christian University', 'Abilene', 'TX', 'USA'),
 (1, 'adelphi', 'Adelphi University', 'Garden City', 'NY', 'USA'),
 (2, 'adrianmi', 'Adrian College', 'Adrian', 'MI', 'USA'),
 (3, 'akron', 'University of Akron', 'Akron', 'OH', 'USA'),
 (4, 'alabama', 'University of Alabama', 'Tuscaloosa', 'AL', 'USA')]

In [14]:
%sql select * from Batting limit 5;

 * sqlite:///Data/hw1sql.db
Done.

[(0, 'abercda01', 1871, 1, 'TRO', None, 1, 4, 0, 0, 0, 0, 0, 0.0, 0.0, 0.0, 0, 0.0, None, None, None, None, 0.0),
 (1, 'addybo01', 1871, 1, 'RC1', None, 25, 118, 30, 32, 6, 0, 0, 13.0, 8.0, 1.0, 4, 0.0, None, None, None, None, 0.0),
 (2, 'allisar01', 1871, 1, 'CL1', None, 29, 137, 28, 40, 4, 5, 0, 19.0, 3.0, 1.0, 2, 5.0, None, None, None, None, 1.0),
 (3, 'allisdo01', 1871, 1, 'WS3', None, 27, 133, 28, 44, 10, 2, 2, 27.0, 1.0, 1.0, 0, 2.0, None, None, None, None, 0.0),
 (4, 'ansonca01', 1871, 1, 'RC1', None, 25, 120, 29, 39, 11, 3, 0, 16.0, 6.0, 2.0, 2, 1.0, None, None, None, None, 0.0)]

In [15]:
%sql select * from HallOfFame limit 5;

 * sqlite:///Data/hw1sql.db
Done.

[(0, 'cobbty01', 1936, 'BBWAA', 226.0, 170.0, 222.0, 'Y', 'Player', None),
 (1, 'ruthba01', 1936, 'BBWAA', 226.0, 170.0, 215.0, 'Y', 'Player', None),
 (2, 'wagneho01', 1936, 'BBWAA', 226.0, 170.0, 215.0, 'Y', 'Player', None),
 (3, 'mathech01', 1936, 'BBWAA', 226.0, 170.0, 205.0, 'Y', 'Player', None),
 (4, 'johnswa01', 1936, 'BBWAA', 226.0, 170.0, 189.0, 'Y', 'Player', None)]

## Sample

- This is an example of the structure of the remaining questions and answers.

__Question__

- Find the ```playerID, nameLast, nameFirst, birthCity, birthState, birthCountry``` and ```birthYear``` for entities in ```People``` with ```nameLast``` Williams ```birthCity``` San Diego.

<u>Answer:</u>

In [16]:
%sql select playerID, nameLast, nameFirst, birthCity, \
    birthState, birthCountry from People where nameLast='Williams' and birthCity='San Diego'

 * sqlite:///Data/hw1sql.db
Done.

[('willite01', 'Williams', 'Ted', 'San Diego', 'CA', 'USA'),
 ('willitr01', 'Williams', 'Trevor', 'San Diego', 'CA', 'USA')]

## Question 3.1

- Select the ```nameLast, nameFirst, givenName``` for entities in ```People``` who are between 6 ft and 6 ft 5 inches
tall.


- You will have to examine the column names and sample values to understand which columns and how to use them for this query.


- You only need to return 10 rows.

<u>Answer:</u>

In [17]:
%sql SELECT nameFirst,nameLast,nameGiven,height from People \
where height>72 and height<78 limit 10;

 * sqlite:///Data/hw1sql.db
Done.

[('David', 'Aardsma', 'David Allan', 75.0),
 ('Tommie', 'Aaron', 'Tommie Lee', 75.0),
 ('Don', 'Aase', 'Donald William', 75.0),
 ('Andy', 'Abad', 'Fausto Andres', 73.0),
 ('Fernando', 'Abad', 'Fernando Antonio', 73.0),
 ('Jeff', 'Abbott', 'Jeffrey William', 74.0),
 ('Jim', 'Abbott', 'James Anthony', 75.0),
 ('Kyle', 'Abbott', 'Lawrence Kyle', 76.0),
 ('Paul', 'Abbott', 'Paul David', 75.0),
 ('Al', 'Aber', 'Albert Julius', 74.0)]

## Question 3.2

- Create a Table of all the distinct players with a first name of Bob who were born in the United States and played at Stanford university


- Include their ```first name, last name, playerID```, and ```birth state```


- Hint: Use a Join between ```People``` and ```CollegePlaying```


- You only need to return 10 rows.

<u>Answer:</u>

In [18]:
%sql DROP TABLE IF EXISTS BOB;

 * sqlite:///Data/hw1sql.db
Done.

[]

In [19]:
%sql CREATE TABLE BOB AS\
SELECT distinct nameFirst,nameLast,p.playerID,birthState FROM People p\
left join CollegePlaying c ON p.playerID=c.playerID\
where nameFirst='Bob' and schoolID='stanford';

 * sqlite:///Data/hw1sql.db
Done.

[]

In [20]:
%sql SELECT * FROM BOB limit 10;

 * sqlite:///Data/hw1sql.db
Done.

[('Bob', 'Boone', 'boonebo01', 'CA'),
 ('Bob', 'Gallagher', 'gallabo01', 'MA'),
 ('Bob', 'Kammeyer', 'kammebo01', 'KS'),
 ('Bob', 'Reece', 'reecebo01', 'CA')]

## Question 3.3

- Group together players with the same birth year, and report the year, the number of players in the year, and average height for the year


- Order the resulting by year in descending order. Put this in a new table called ```AverageHeight```


- Hint: height will be NULL for some of these years, do not consider these entries


- Run the SELECT * statement to show that your table was created successfully.

<u>Answer:</u>

In [25]:
%sql DROP TABLE IF EXISTS AverageHeight;

 * sqlite:///Data/hw1sql.db
Done.

[]

In [27]:
%sql CREATE TABLE AverageHeight AS\
SELECT birthYear, count(*),avg(height)\
from People\
where height is not null\
group by birthYear\
order by birthYear desc;

 * sqlite:///Data/hw1sql.db
Done.

[]

In [28]:
%sql SELECT * FROM AverageHeight LIMIT 10;

 * sqlite:///Data/hw1sql.db
Done.

[(1998.0, 1, 73.0),
 (1997.0, 10, 72.8),
 (1996.0, 23, 73.08695652173913),
 (1995.0, 56, 73.60714285714286),
 (1994.0, 108, 73.55555555555556),
 (1993.0, 171, 73.98245614035088),
 (1992.0, 199, 73.83417085427136),
 (1991.0, 215, 73.78139534883721),
 (1990.0, 240, 73.79583333333333),
 (1989.0, 232, 73.64655172413794)]

## Question 3.4

- Find the players who made it into the hall of fame who played for a college located in NJ


- Return the ```player ID, first name, last name```, and ```school ID```. 


- Order the players by ```School``` alphabetically.


- You only need to return 10 rows.

<u>Answer:</u>

In [24]:
%sql SELECT distinct p.playerID,p.nameFirst,p.nameLast,s.schoolID\
from (People p join HallOfFame h using(playerID) join CollegePlaying using(playerID) join Schools s using(schoolID))\
where s.state='NJ' and h.inducted='Y'\
limit 10;

 * sqlite:///Data/hw1sql.db
Done.

[('biggicr01', 'Craig', 'Biggio', 'setonhall')]

## Question 3.5

- Find the ```team id, yearid```, and ```average HBP``` for each team using a subquery.


- Group the entries by ```team``` and ```year``` and order by descending values


- Hint: be careful to only include entries where ```AB``` is > 0


- You need to return 50 rows.

<u>Answer:</u>

In [31]:
%sql SELECT teamID, yearID,avg(HBP) as avg_HBP\
from (SELECT teamID,yearID,HBP\
     from Batting\
     where AB>0)\
     group by teamID,yearID\
     order by avg_HBP desc\
     limit 50;

 * sqlite:///Data/hw1sql.db
Done.

[('BLN', 1898, 6.666666666666667),
 ('BL3', 1891, 6.166666666666667),
 ('BLN', 1897, 5.75),
 ('BLN', 1896, 5.454545454545454),
 ('BLN', 1895, 5.3),
 ('BLN', 1899, 5.083333333333333),
 ('BLN', 1894, 4.9),
 ('NY1', 1905, 4.7368421052631575),
 ('NY1', 1903, 4.6),
 ('TOR', 1996, 4.6),
 ('BRO', 1899, 4.464285714285714),
 ('BSN', 1891, 4.1),
 ('BL2', 1887, 4.0),
 ('CN2', 1889, 4.0),
 ('PHI', 1893, 3.9444444444444446),
 ('SL4', 1887, 3.9411764705882355),
 ('CL5', 1884, 3.933333333333333),
 ('TOR', 2005, 3.869565217391304),
 ('CLE', 2008, 3.814814814814815),
 ('SLN', 1901, 3.75),
 ('BFP', 1890, 3.6923076923076925),
 ('BSN', 1890, 3.6315789473684212),
 ('TOR', 2003, 3.6),
 ('BL2', 1889, 3.5652173913043477),
 ('TL2', 1890, 3.55),
 ('CN2', 1888, 3.5294117647058822),
 ('CAL', 1978, 3.526315789473684),
 ('BRO', 1900, 3.5217391304347827),
 ('PH4', 1888, 3.5),
 ('WAS', 1893, 3.5),
 ('BSN', 1903, 3.4705882352941178),
 ('BSN', 1892, 3.4444444444444446),
 ('CL3', 1888, 3.4347826086956523),
 ('NY1', 1904, 3.4347826086956523),
 ('CIN', 1897, 3.4210526315789473),
 ('BL2', 1884, 3.3684210526315788),
 ('PTP', 1890, 3.3529411764705883),
 ('PIT', 1897, 3.35),
 ('BR3', 1889, 3.2666666666666666),
 ('SL4', 1885, 3.2666666666666666),
 ('PHI', 1899, 3.260869565217391),
 ('MIN', 1996, 3.25),
 ('OAK', 1988, 3.25),
 ('SL4', 1886, 3.25),
 ('SLN', 1900, 3.24),
 ('CHA', 2011, 3.230769230769231),
 ('PH4', 1891, 3.217391304347826),
 ('ANA', 2001, 3.2083333333333335),
 ('PHP', 1890, 3.1875),
 ('BRO', 1892, 3.176470588235294)]

## OPTIONAL UNGRADED QUESTION  

- Find the top 10 most common first names in Baseball history.


- Find the top 10 most common first names that made it into the hall of fame in baseball history.


- What have you learned?

<u>Answer:</u>

In [32]:
%sql select nameFirst,count(*) as count\
from People\
group by nameFirst\
order by count desc\
limit 10

 * sqlite:///Data/hw1sql.db
Done.

[('Bill', 547),
 ('John', 492),
 ('Mike', 444),
 ('Jim', 441),
 ('Joe', 402),
 ('Bob', 341),
 ('George', 305),
 ('Tom', 280),
 ('Ed', 279),
 ('Frank', 275)]

In [33]:
%sql select nameFirst,count(*) as count\
from (HallOfFame join People p using(playerID))\
group by playerID\
order by count desc\
limit 10

 * sqlite:///Data/hw1sql.db
Done.

[('Edd', 20),
 ('Ross', 19),
 ('Ray', 18),
 ('Red', 18),
 ('Hack', 17),
 ('Zack', 17),
 ('Dazzy', 17),
 ('Phil', 17),
 ('Eppa', 17),
 ('Pee Wee', 17)]

$$ \alpha^2 $$